base/Catalogs/бит_ВидыФормСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыФормСбораДанных</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Имя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчикаПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтекПеременных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиРеквизитов</Name>
					<Comment>Настройки реквизитов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Comment>Имя таблицы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Comment>Синоним</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрТип</Name>
							<Comment>Доступные типы значений в строковом представлении</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>Служит для связи с данными дерева</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПоля</Name>
							<Comment>Вид поля</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыПолейПроформы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполнения</Name>
							<Comment>Проверка заполнения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаВыбора</Name>
							<Comment>Кнопка выбора</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаОчистки</Name>
							<Comment>Кнопка очистки</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаОткрытия</Name>
							<Comment>Кнопка открытия</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Comment>Ширина</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаРегулирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыражениеПредставления</Name>
							<Comment>Выражение представления</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеНастроек</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУстановлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьИтог</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиДвижений</Name>
					<Comment>Движения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Comment>Активность</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонДвижений</Name>
							<Comment>Шаблон движений</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ВидыФормСбораДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти	

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет список имен, запрещенных для использования в проформах.
// 
// Параметры:
//  СписокЗапрещенных - Список значений.
// 
Процедура СформироватьСписокЗапрещенныхИмен(СписокЗапрещенных) Экспорт

	СписокЗапрещенных.Очистить();
	
	СписокЗапрещенных.Добавить("Дата");
	СписокЗапрещенных.Добавить("Номер");
	СписокЗапрещенных.Добавить("Проведен");
	СписокЗапрещенных.Добавить("ПометкаУдаления");
	СписокЗапрещенных.Добавить("ВалютаДокумента");
	СписокЗапрещенных.Добавить("КурсДокумента");
	СписокЗапрещенных.Добавить("КратностьДокумента");
	СписокЗапрещенных.Добавить("Ответственный");	
	СписокЗапрещенных.Добавить("Комментарий");
	
КонецПроцедуры // СформироватьСписокЗапрещенныхИмен()

// Функция формирует данные необходимые для выгрузки проформы в Эксель.
// 
// Параметры:
//  ВхВидПроформы - СправочникСсылка.бит_ВидыФормСбораДанных, Массив.
// 
// Возвращаемое значение:
//  ДанныеВыгрузки - Структура
// 
Функция ПодготовитьДанныеДляВыгрузкиШаблона(ВхВидПроформы) Экспорт

	МассивВидов = Новый Массив;
	
	Если ТипЗнч(ВхВидПроформы) = Тип("Массив") Тогда
		
		МассивВидов = ВхВидПроформы;
		
	Иначе	
		
		МассивВидов.Добавить(ВхВидПроформы);
		
	КонецЕсли; 
	
	// Подготовка псевдометаданных и данных необходимых для формирования шаблона.
	МассивДанных = Новый Массив;	
	Для каждого ВидПроформы Из МассивВидов Цикл
		
		СтрПар = Новый Структура;
		СтрПар.Вставить("ПсевдоМетаданные", бит_РаботаСПроизвольнымиФормами.ЭмулироватьМетаданные(ВидПроформы));
		СтрПар.Вставить("ВидПроформы", ВидПроформы);
		СтрПар.Вставить("Наименование", ВидПроформы.Наименование);
		
		МассивДанных.Добавить(СтрПар);
		
	КонецЦикла; 
	
	// Подготовка списков для выгрузки
	СпискиВыгрузки = Новый Соответствие;
	ВидыПредставлений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивВидов",МассивВидов);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиРеквизитов.СтрТип,
	               |	НастройкиРеквизитов.ВыражениеПредставления
	               |ИЗ
	               |	Справочник.бит_ВидыФормСбораДанных.НастройкиРеквизитов КАК НастройкиРеквизитов
	               |ГДЕ
	               |	НастройкиРеквизитов.Выгружать
	               |	И НастройкиРеквизитов.Ссылка В(&МассивВидов)
	               |	И (НЕ НастройкиРеквизитов.НастройкиУстановлены)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НастройкиРеквизитов.Имя,
	               |	НастройкиРеквизитов.СтрТип,
	               |	НастройкиРеквизитов.ВыражениеПредставления,
	               |	НастройкиРеквизитов.ХранилищеНастроек
	               |ИЗ
	               |	Справочник.бит_ВидыФормСбораДанных.НастройкиРеквизитов КАК НастройкиРеквизитов
	               |ГДЕ
	               |	НастройкиРеквизитов.Ссылка В(&МассивВидов)
	               |	И НастройкиРеквизитов.Выгружать
	               |	И НастройкиРеквизитов.НастройкиУстановлены";			   
				   
				   
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// Получение списков без отборов и порядка
	ТаблицаНастройки = МассивРезультатов[0].Выгрузить();
	ТаблицаНастройки.Свернуть("СтрТип, ВыражениеПредставления");
	
	Для каждого СтрокаТаблицы Из ТаблицаНастройки Цикл
		
		ТекстЗапроса = ПодготовитьТекстЗапросаДляВыгрузки(СтрокаТаблицы.СтрТип, СтрокаТаблицы.ВыражениеПредставления);
		СписокВыгрузки = ЗаполнитьСписокВыгрузки(ТекстЗапроса, СтрокаТаблицы.СтрТип);
		
		Если СписокВыгрузки.Количество() > 0 Тогда
			
			Если ПустаяСтрока(СтрокаТаблицы.ВыражениеПредставления) Тогда
				
				Ключ = СтрокаТаблицы.СтрТип;
				
			Иначе	
				
				ВидыПредставлений.Добавить(СтрокаТаблицы.СтрТип+"/"+СтрокаТаблицы.ВыражениеПредставления);
				Ключ = СтрокаТаблицы.СтрТип+"_PresentationType_"+Формат(ВидыПредставлений.Количество(),"ЧРГ=");
				
			КонецЕсли; 
			
			СпискиВыгрузки.Вставить(Ключ, СписокВыгрузки);
			
		КонецЕсли; 
		
	КонецЦикла; // ТаблицаНастройки
	
	// Получение списков с учетом настроек построителя - отборами и порядком.
	ТаблицаНастройки = МассивРезультатов[1].Выгрузить();
	
	Для каждого СтрокаТаблицы Из ТаблицаНастройки Цикл
		
		ТекстЗапроса = ПодготовитьТекстЗапросаДляВыгрузки(СтрокаТаблицы.СтрТип, СтрокаТаблицы.ВыражениеПредставления);
		СтрНастр = СтрокаТаблицы.ХранилищеНастроек.Получить();
		СписокВыгрузки = ЗаполнитьСписокВыгрузки(ТекстЗапроса, СтрокаТаблицы.СтрТип, СтрНастр, "Построитель");
		
		Если СписокВыгрузки.Количество() > 0 Тогда
			
			СпискиВыгрузки.Вставить(СтрокаТаблицы.Имя, СписокВыгрузки);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// Обязательные списки - Булево и Валюты
	ВыгрузитьОбязательныеСписки(СпискиВыгрузки);
	
	ДанныеВыгрузки = Новый Структура;
	// Псевдо метаданные и ссылки на виды проформ.
	ДанныеВыгрузки.Вставить("МассивДанных", МассивДанных);
	// Списки, которые будут устанавливаться в качестве списков выбора.
	ДанныеВыгрузки.Вставить("СпискиВыгрузки", СпискиВыгрузки);
	// Испольуемые виды представлений
	ДанныеВыгрузки.Вставить("ВидыПредставлений", ВидыПредставлений);
	
	СисИнфо = бит_ОбщегоНазначения.ПолучитьСведенияОПрограмме();
	ДанныеВыгрузки.Вставить("НомерРелизаБИТ"  , СисИнфо.НомерРелиза_1С);
	
	
	Возврат ДанныеВыгрузки;
	
КонецФункции // ПодготовитьДанныеДляВыгрузкиШаблона()

// Функция формирует текст запроса, для извлечения данных списков выгружаемых в Эксель.
// В Эксель списки используются в качестве списков выбора для полей соответсвующих типов.
// 
// Параметры:
//   СтрТип - Строка
//   ВыражениеПредставления - Строка.
// 
// Возвращаемое значение:
//  ТекстЗапроса - Строка.
// 
Функция ПодготовитьТекстЗапросаДляВыгрузки(СтрТип, ВыражениеПредставления = "") Экспорт
	
	ТекстЗапроса = "";
	
	// Заготовки для формирования текста запроса.
	ШаблонЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |   ""%ИмяПолное%"" КАК ИмяПолное,
					|   ""%ИмяОбъекта%"" КАК ИмяОбъекта,
					|   %ВыражениеПредставления% КАК Представление,
	                |	ТекТаб.Ссылка КАК Ссылка
					|{ВЫБРАТЬ
	                | Представление.*,
	                | Ссылка.*}
	                |ИЗ
	                |	%ИмяТаблицы% КАК ТекТаб
					|";
					
	ШаблонОбъединить = "
	                   |ОБЪЕДИНИТЬ ВСЕ
	                   |";
					   
    ШаблонНеГруппа = "
                    |ГДЕ
	                |(НЕ ТекТаб.ЭтоГруппа)
					|";
					
	ШаблонИнстр = "
				   |{ГДЕ
	               | ТекТаб.Ссылка.*}
                   |{УПОРЯДОЧИТЬ ПО
	               | Ссылка.*}
				   |";

					   
	ШаблонАвтоУп	= "АВТОУПОРЯДОЧИВАНИЕ";
	
	
	Типы = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТипыИзСтроки(СтрТип);
	
	Описание = Новый ОписаниеТипов(Типы);
	
	Для каждого ТекТип Из Типы Цикл
		
		Если НЕ бит_ОбщегоНазначенияКлиентСервер.ЭтоПримитивныйТип(ТекТип) Тогда
			
			МетаОбъект = Метаданные.НайтиПоТипу(ТекТип);
			
			Если НЕ МетаОбъект = Неопределено Тогда
				
				ИмяПолное = МетаОбъект.ПолноеИмя();
				СтрИмена = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ИмяПолное);
				ИмяТаблицы = СтрИмена.ИмяКласса+"."+СтрИмена.ИмяОбъекта;					  
				
				ТекстТекТаблица = ШаблонЗапроса;
				ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица,"%ИмяПолное%", ИмяПолное);
				ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица,"%ИмяОбъекта%", СтрИмена.ИмяОбъекта);					  
				ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица,"%ИмяТаблицы%",ИмяТаблицы);
				
				Если НЕ ПустаяСтрока(ВыражениеПредставления) Тогда
					
					ВыражениеПредставления = СтрЗаменить(ВыражениеПредставления,"Ссылка.","ТекТаб.");
					ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица,"%ВыражениеПредставления%",ВыражениеПредставления);						  
					
				Иначе	
					
					ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица,"%ВыражениеПредставления%","ПредставлениеСсылки(ТекТаб.Ссылка)");
					
				КонецЕсли; 
				
				Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
					
					ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица,"РАЗРЕШЕННЫЕ","");
					
				КонецЕсли; 
				
				// Группы не выгружаем
				Если бит_ОбщегоНазначения.ОбъектПринадлежитКоллекцииМетаданных("Справочники", СтрИмена.ИмяОбъекта) Тогда
				
					Если МетаОбъект.Иерархический 
						 И МетаОбъект.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
					
						 ТекстТекТаблица = ТекстТекТаблица+ШаблонНеГруппа;
					
					КонецЕсли; 
				
				КонецЕсли; 
				
				ТекстЗапроса = ТекстЗапроса+?(ПустаяСтрока(ТекстЗапроса),"",ШаблонОбъединить)+ТекстТекТаблица;
				
			КонецЕсли; 
			
		КонецЕсли; // Тип не примитивный
		
	КонецЦикла; // Типы
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		ТекстЗапроса = ТекстЗапроса+ШаблонИнстр+ШаблонАвтоУп;
		
	КонецЕсли; 
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПодготовитьТекстЗапросаДляВыгрузки()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура готовит списки, которые нужно выгружать обязательно. 
// 
// Параметры:
//  СпискиВыгрузки - Булево.
// 
Процедура ВыгрузитьОбязательныеСписки(СпискиВыгрузки)
	
	// Булево
	СписокБулево = Новый СписокЗначений;
	СписокБулево.Добавить("Истина", "Да");
	СписокБулево.Добавить("Ложь", "Нет");
	
	СпискиВыгрузки.Вставить("Булево", СписокБулево);
	
	// Валюты
	СтрТипВалюты = "СправочникСсылка.Валюты";	
	
	Если СпискиВыгрузки[СтрТипВалюты] = Неопределено Тогда
		
		ТекстЗапроса = ПодготовитьТекстЗапросаДляВыгрузки(СтрТипВалюты);
		СписокВыгрузки = ЗаполнитьСписокВыгрузки(ТекстЗапроса, СтрТипВалюты);
		
		Если СпискиВыгрузки.Количество() > 0 Тогда
			
			СпискиВыгрузки.Вставить(СтрТипВалюты ,СписокВыгрузки);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // ВыгрузитьОбязательныеСписки()	

// Функция извлекает из БД список для выгрузки в Эксель.
// В Эксель список будет установлен в качестве списка выбора для полей соответсвующих типов.
// 
// Параметры:
//   ТекстЗапроса - Строка
//   СтрТип - Строка
// 
// Возвращаемое значение:
//  СписокВыгрузки - СписокЗначений.
// 
Функция ЗаполнитьСписокВыгрузки(ТекстЗапроса, СтрТип, СтрНастроек = Неопределено, Режим = "Запрос")
	
	СписокВыгрузки = Новый СписокЗначений;
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		Если Режим = "Построитель" Тогда
			
			Построитель = Новый ПостроительЗапроса;
			Построитель.Текст = ТекстЗапроса;
			// Построитель.ЗаполнитьНастройки();
			
			Если ТипЗнч(СтрНастроек) = Тип("Структура") Тогда
			
				СтруктураНастроек = СтрНастроек.СтруктураНастроек;
				
				Если СтруктураНастроек.Свойство("Отбор") Тогда
				
					Для каждого СтрОтбор Из СтруктураНастроек.Отбор Цикл
					
						   НовыйЭлОтбора = Построитель.Отбор.Добавить(СтрОтбор.ПутьКДанным);
						   бит_ОбщегоНазначения.ЗаполнитьЭлементОтбора(СтрОтбор, НовыйЭлОтбора);
					
					КонецЦикла; 
				
				КонецЕсли; 
				
				Если СтруктураНастроек.Свойство("Порядок") Тогда
					
					бит_МеханизмПолученияДанных.УстановитьПорядокПостроителя(СтруктураНастроек.Порядок, Построитель, НаправлениеСортировки);
				
				КонецЕсли; 
				
			КонецЕсли; 
			
			Попытка
			
				Построитель.Выполнить();
				Результат = Построитель.Результат;
			
			Исключение
				
				ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось выгрузить список для типа ""%1"" по причине ""%2"".';
												|en='Unable to upload a list of type ""%1"" because of the ""%2"".'"),
										   СтрТип, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				Результат = Неопределено;
				
			КонецПопытки;
			
		Иначе	
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			
			Попытка
				
				Результат = Запрос.Выполнить();
				
			Исключение
				
				ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось выгрузить список для типа ""%1"" по причине ""%2"".';
												|en='Unable to upload a list of type ""%1"" because of the ""%2"".'"),
										   СтрТип, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				Результат = Неопределено;
				
			КонецПопытки;
			
			
		КонецЕсли; 
		
		
		Если ТипЗнч(Результат) = Тип("РезультатЗапроса") Тогда
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Найти(Выборка.ИмяПолное,"Перечисление") > 0 Тогда
					
					ТекПеречисление = Перечисления[Выборка.ИмяОбъекта];
					ИмяЗначения = бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(ТекПеречисление, Выборка.Ссылка);
					
					СтрСсылка = Выборка.ИмяПолное+"."+ИмяЗначения;
					СтрПредставление = ИмяЗначения;
					
					
				Иначе	 
					
					СтрСсылка = Выборка.ИмяПолное+"/"+Строка(Выборка.Ссылка.УникальныйИдентификатор());
					СтрПредставление = Выборка.Представление;
					
				КонецЕсли; 
				
				СписокВыгрузки.Добавить(СтрСсылка, СтрПредставление);
				
				
			КонецЦикла; // Выборка
			
		КонецЕсли; // ЕстьРезультат
		
	КонецЕсли; 
	
	Возврат СписокВыгрузки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
